Repository: AkidFikriAzhar/safmobile_portal
Catalog: lib/l10n/app_*.arb
Languages: ms

# language
source: English
ms: Bahasa Melayu

# homeTitle
source: Check Your Invoice, Receipt or Service Order Status
ms: Lihat Invois, Resit atau Status Service Order Anda

source: Search
ms: Cari

source: Change Language
ms: Tukar Bahasa

source: Enter Ticket ID
ms: Masukkan Tiket ID

# scanQr
source: Scan QR Code
ms: Imbas Kod QR

# copyright
source: © 2025 Assaff Enterprise 202103058817 (003242985-U) | All Rights Reserved
ms: © 2025 Assaff Enterprise 202103058817 (003242985-U) | Hak Cipta Terpelihara

source: Theme
ms: Tema

source: More
ms: Lagi

# errorTicketId
source: Please enter correct ticket ID!
ms: Sila masukkan Tiket ID yang betul!

source: Search Result
ms: Hasil Carian

# noResult
source: No records found
ms: Tiada rekod dijumpai

# loading
source: Loading data...
ms: Memuatkan data...

# showingResult
source: Showing results for Ticket ID
ms: Menunjukkan hasil carian untuk Tiket ID

source: Receipt
ms: Resit & Waranti

source: Invoice
ms: Invois

# paymentMade
source: Payment has been made
ms: Bayaran telah dibuat

# paymentNotMade
source: Payment has not been made
ms: Bayaran belum dibuat

source: Close
ms: Tutup

# billingItem
source: Billing {length} Item(s)
ms: {length} Item dalam Bil

source: Paid
ms: Telah Dibayar

source: Unpaid
ms: Belum Dibayar

# customerInfo
source: Customer Information
ms: Maklumat Pelanggan

# technicianInfo
source: Technician Information
ms: Maklumat Juruteknik

source: Issued
ms: Dikeluarkan

source: Due
ms: Tarikh Tamat

source: Warranty
ms: Jaminan

source: Price
ms: Harga

source: Total
ms: Jumlah

source: Discount
ms: Diskaun

source: Payment Method
ms: Kaedah Pembayaran

source: Amount
ms: Amaun

source: Pay Now
ms: Bayar Sekarang

source: Download PDF
ms: Muat Turun PDF

source: General Information
ms: Maklumat Umum

source: Repair Status
ms: Status Pembaikan

source: Received Date
ms: Tarikh Diterima

# estimatedDate
source: Estimated Done
ms: Anggaran Siap

source: Device Model
ms: Model Peranti

source: Device Colour
ms: Warna Peranti

source: Device IMEI
ms: IMEI Peranti

source: Drop Off Branch
ms: Cawangan Serahan

source: Return Reason
ms: Sebab Pemulangan

source: Pending
ms: Menunggu

# pendingDescription
source: Your device has been successfully received and is currently in queue for technical inspection.
ms: Peranti anda telah berjaya diterima dan sedang menunggu giliran untuk pemeriksaan teknikal.

source: Diagnose
ms: Diagnosis

# diagnoseDescription
source: Our technician is performning a detailed inspection to identify the root cause of the issue with your device.
ms: Juruteknik kami sedang menjalankan pemeriksaan terperinci untuk mengenalpasti punca masalah pada peranti anda.

source: Repair
ms: Pembaikan

# repairDescription
source: The repair process is underway based on the diagnosis. Components will be replaced if necessary to restore your device's functionality.
ms: Proses pembaikan sedang dijalankan berdasarkan hasil diagnosa. Komponen akan diganti jika perlu untuk memulihkan fungsi peranti anda.

source: Checking
ms: Pemeriksaan

# checkingDescription
source: The device has been repaired and is now undergoing a final qualiy check to ensure all functions are working properly.
ms: Peranti telah dibaiki dan kini menjalani pemeriksaan akhir kualiti untuk memastikan semua fungsi beroperasi dengan baik.

source: Done
ms: Selesai

# doneDescription
source: Your device has been successfully repaired and is ready for pickup.
ms: Peranti anda telah berjaya dibaiki dan sedia untuk diambil.

# returnDevice
source: Device cannot be repaired
ms: Peranti tidak dapat diperbaiki

source: Reason
ms: Alasan

source: Total Amount
ms: Jumlah Keseluruhan

source: Secure Payment
ms: Pembayaran terjamin dari

source: Name
ms: Nama

# nameError
source: Please enter your name
ms: Sila masukkan nama anda

source: Phone Number
ms: Nombor Telefon

# phoneNumberError
source: Please enter your phone number
ms: Sila masukkan nombor telefon anda

# emailError
source: Please enter your email
ms: Sila massukkan alamat email anda

# continueText
source: Continue
ms: Teruskan

source: Cancel
ms: Batal

# pleaseWaitCreatingBill
source: Please wait while we processing your payment...
ms: Sila tunggu sementara kami memproses bayaran anda...

source: Confirm Payment
ms: Pembayaran

# confirmPaymentDescription
source: You will redirect to the payment page. By proceeding, you agree to our
ms: Anda akan dibawa ke halaman pembayaran. Dengan meneruskan, anda bersetuju dengan

source: Terms and Conditions
ms: Terma dan Syarat

# agreeContinue
source: I agree and continue
ms: Saya setuju dan teruskan

source: Payment Success
ms: Pembayaran Berjaya

# paymentSuccessDialogDescription
source: This invoice has been paid successfully.
ms: Invois ini telah berjaya dibayar

# paymentProcessing
source: Your Payment Has Been Processed
ms: Pembayaran Sedang Diproses

# paymentProcessingDescription
source: If your payment is successful, it will be automatically reflected in our system. You can return to main portal to check your payment status
ms: Jika pembayaran anda berjaya, status akan dikemaskini secara automatik dalam sistem kami. Anda boleh kembali ke portal utama untuk menyemak status pembayaran.

source: Reopen Payment Page
ms: Buka Semula Halaman Pembayaran

source: Return to Main Portal
ms: Kembali ke Portal Utama

source: Payment Completed
ms: Pembayaran Selesai

# paymentCompletedDescription
source: We have successfully received your payment. You may have safely return to our portal to check your payment status.
ms: Kami telah menerima pembayaran anda dengan berjaya. Anda boleh kembali ke halaman portal utama untuk menyemak status pembayaran.

source: About
ms: Tentang Saf Mobile Portal

# terms
source: Terms of Services
ms: Terma dan Syarat

# privacy
source: Privacy Policy
ms: Dasar Privasi

# refund
source: Return & Refund Policy
ms: Polisi Bayaran Balik & Pemulangan

# contact
source: Contact Us
ms: Hubungi Kami

# aboutTitle
source: 🛠️ About Saf Mobile Portal
ms: 🛠️ Mengenai Saf Mobile Portal

# aboutDescription
source: Saf Mobile Portal is a dedicated customer platform proudly developed by Akid Fikri Azhar — founder of Saf Mobile and TheKampungKod </>. Designed to simplify repair tracking and payments, this portal reflects our commitment to transparency, convenience, and leveraging modern technology in line with current digital trends.
ms: Saf Mobile Portal ialah platform pelanggan yang dibangunkan khas oleh Akid Fikri Azhar — pengasas Saf Mobile dan TheKampungKod </>. Portal ini dibina untuk memudahkan semakan status pembaikan dan pembayaran, sejajar dengan komitmen kami terhadap ketelusan, kemudahan dan memanfaatkan penggunaan teknologi yang moden seiring arus masa kini.

# goalTitle
source: 🎯 Our Goals
ms: 🎯 Matlamat Kami

# goalIntro
source: We develop this Saf Mobile Portal with 3 main goals in mind:
ms: Kami bangunkan Saf Mobile Portal ini dengan 3 maklamat utama:

# goal1Bold
source: ✅ Transparency
ms: ✅ Ketelusan

# goal1
source: Check your job sheet status anytime.
ms: Semak status job sheet anda bila-bila masa.

# goal2Bold
source: ✅ Convenience
ms: ✅ Kemudahan

# goal2
source: Settle your invoice online in advance — so your pickup process at the shop will be smoother and faster.
ms: Bayar invois lebih awal secara dalam talian – supaya urusan pickup di kedai jadi lebih pantas dan mudah.

# goal3Bold
source: ✅ Security
ms: ✅ Keselamatan

# goal3
source: Your data is protected and processed securely.
ms: Data anda dilindungi dan diproses dengan selamat.

# featuresTitle
source: 📱 Features
ms: 📱 Kelebihan

# feature1Title
source: 🔍 Check Repair Status
ms: 🔍 Semak Status Pembaikan

# feature1Desc
source: Scan the QR code on your receipt to access your job sheet status instantly.
ms: Imbas kod QR pada resit anda untuk terus akses status job sheet.

# feature2Title
source: 💸 Pay Pending Invoices
ms: 💸 Bayar Invois Tertunggak

# feature2Desc
source: View invoice details and pay via FPX, e-wallet, debit / credit card or Buy Now Pay Later.
ms: Lihat butiran invois dan buat pembayaran melalui FPX, e-wallet, kad kredit / debit atau Buy Now Pay Later.

# feature3Title
source: 📜 Digital Records
ms: 📜 Rekod Digital

# feature3Desc
source: Keep service and payment history for future reference.
ms: Simpan sejarah servis dan bayaran untuk rujukan masa depan.

# whoShouldUseTitle
source: 🤝 Who Should Use This?
ms: 🤝 Siapa Patut Guna Aplikasi Web Ini?

# whoShouldUseDesc
source: This portal is designed for Saf Mobile customers who want to: • Check repair status easily • Pay outstanding balance anytime • Stay updated with service progress
ms: Portal ini direka khas untuk pelanggan Saf Mobile yang ingin: • Semak status dengan mudah • Bayar baki bila-bila masa • Kekal kemas kini dengan servis

# techTitle
source: 🧠 Technology Behind the Portal
ms: 🧠 Teknologi Digunakan

# techDesc
source: Saf Mobile Portal is built with Flutter and Firebase — delivering a fast, secure, and smooth experience.
ms: Saf Mobile Portal dibina menggunakan Flutter dan Firebase — untuk pengalaman yang pantas, selamat dan lancar.

# getStartedTitle
source: 📌 Get Started
ms: 📌 Mula Sekarang

# getStartedDesc
source: If you received a receipt with a QR code, scan it to access your portal. Need help? Contact us via WhatsApp.
ms: Jika anda menerima resit dengan kod QR, imbas untuk akses portal. Perlukan bantuan? Hubungi kami melalui WhatsApp.

# useSafMobileNow
source: Use Saf Mobile Portal Now
ms: Gunakan Saf Mobile Portal Sekarang

source: Version
ms: Versi

source: What is Ticket ID ?
ms: Apa itu Ticket ID ?

# whatIsTicketIdDesc
source: The Ticket ID is a unique service reference number for your device. It is located next to the QR code on documents such as the Service Order or Invoice. You can also scan the QR code on the document for quicker access.
ms: Ticket ID adalah nombor rujukan unik servis untuk peranti anda, Ia terletak bersebelahan kod QR pada dokumen seperti Service Order atau Invoice. Anda juga boleh imbas QR yang terdapat pada dokumen tersebut untuk akses lebih pantas.
